bricks/olymp/olymp/ejik/2014a.org
#+HTML_DOCTYPE: html5
#+OPTIONS: toc:nil num:nil html5-fancy:t
#+MACRO: begin-block #+HTML: <div class="$1">
#+MACRO: end-block #+HTML: </div>

{{{begin-block(Page)}}}

* Третья командная олимпиада по программированию Ёjik

*5 октября 2014 года* состоится третья командная олимпиада по
программированию Ёjik (произносится «ёжик»).
Это командное соревнование, которое проводится в один компьютерный тур
продолжительностью 3 часа. Команде из трёх человек предоставляется один
персональный компьютер и предлагается решить несколько задач. Для решения
участники могут использовать следующие языки программирования: C/C++, C#,
Java, Pascal, Python.

Задачи олимпиады рассчитаны на самый широкий круг участников: они в
большинстве своем доступны школьникам, не овладевшим целиком основами
языка программирования (например, школьникам, не владеющим строками
или двумерными массивами, будут доступны большинство задач).

Понять уровень олимпиады можно посмотрев материалы прошедших
соревнований:

+ [[./2013.html][Осень 2013 года]]
+ [[./2014s.html][Весна 2014 года]]

** Результаты

Третья олимпиада Ёjik состоялась. Большое спасибо за участие!
Победителями стали:

1. Киров, КОГОАУ КФМЛ: половик (Ашихмин Анатолий 8, Сырцев Александр 8, Клёпов Дмитрий 8)
2. Гусь-Хрустальный, МБОУ "СОШ №2": Qwerty (Григорьев Дмитрий 10, Пугачева Ирина 10, Лисененков Глеб 10)
3. Киров, КОГОАУ КЭПЛ (Перминов Максим 11, Чащин Дмитрий 11, Деревянных Михаил 9)

Итоговая таблица:

|-----+-----------------------------------------------------+-----+-----+-----+-----+-----+-----+--------+-------+-------|
|     | Команда                                             | A   | B   | C   | D   | E   | G   | Задачи | Баллы | Место |
|-----+-----------------------------------------------------+-----+-----+-----+-----+-----+-----+--------+-------+-------|
| <c> | <l>                                                 | <c> | <c> | <c> | <c> | <c> | <c> | <c>    | <c>   | <c>   |
| 025 | половик (КОГОАУ КФМЛ, Киров)                        | 100 | 80  | 100 | 100 | 100 |     | 4      | 480   | 1     |
| 013 | Qwerty (МБОУ "СОШ №2", Гусь-Хрустальный)            | 100 | 90  | 99  | 100 | 48  | 0   | 3      | 437   | 2     |
| 012 | КОГОАУ КЭПЛ, Киров                                  | 100 | 70  | 100 | 99  | 55  |     | 3      | 424   | 3     |
| 002 | Da Red (КОГОАУ ЛЕН, Киров)                          | 100 | 80  | 99  | 100 |     |     | 3      | 379   | 4     |
| 004 | AcerAspire (МБОУ "Лицей", Кирово-Чепецк)            | 100 | 70  | 64  | 98  |     |     | 2      | 332   | 5     |
| 007 | ГБОУ СОШ 1247, Москва                               | 100 | 60  | 73  | 96  |     |     | 2      | 329   | 6     |
| 014 | Лабиринт (МБОУ "СОШ №2", Гусь-Хрустальный)          | 100 | 60  | 49  | 100 |     |     | 2      | 309   | 7     |
| 016 | Премудрый Паскаль (МБОУ "СОШ №2", Гусь-Хрустальный) | 100 | 80  | 27  | 100 |     | 0   | 2      | 307   | 8     |
| 019 | DreamTeam (Вятские Поляны)                          | 100 | 60  | 44  | 100 |     |     | 2      | 304   | 9     |
| 022 | Клякса (МКОУ СОШ №2 с УИОП, Вятские Поляны)         | 100 | 50  | 49  | 100 |     |     | 2      | 299   | 10    |
| 024 | МОУ "Лицей №43", Саранск                            | 96  | 70  | 31  | 100 | 0   |     | 2      | 297   | 11    |
| 008 | Skill (лицей № 78, Набережные Челны)                | 100 | 70  | 24  | 97  |     |     | 2      | 291   | 12    |
| 011 | Dantes (лицей № 78, Набережные Челны)               | 100 | 60  | 39  | 76  |     |     | 1      | 275   | 13    |
| 026 | Язь и Компилятор (КОГОАУ КФМЛ, Киров)               | 100 | 70  | 0   | 100 |     |     | 2      | 270   | 14    |
| 009 | EnTer (лицей № 78, Набережные Челны)                | 100 | 70  |     | 98  | 0   |     | 2      | 268   | 15    |
| 006 | Артем и его команда (МБОУ СОШ № 45, Киров)          | 100 | 70  |     | 96  |     |     | 2      | 266   | 16    |
| 005 | PATRIC (МБОУ "Лицей", Кирово-Чепецк)                | 99  | 60  |     | 100 | 0   |     | 2      | 259   | 17    |
| 001 | Три Паскаль (КОГОАУ ЛЕН, Киров)                     | 100 | 80  | 24  | 4   | 0   |     | 1      | 208   | 18    |
| 020 | Penkin & Co (Вятские Поляны)                        | 99  | 0   |     | 100 |     |     | 2      | 199   | 19    |
| 015 | Мужчины (МБОУ "СОШ №2", Гусь-Хрустальный)           | 100 | 60  | 31  |     |     |     | 1      | 191   | 20    |
| 017 | Кубиты (Вятская православная гимназия, Киров)       | 99  | 60  | 16  |     |     |     | 1      | 175   | 21    |
| 003 | SuperHero (КОГОАУ ЛЕН, Киров)                       | 100 | 60  |     | 0   |     |     | 1      | 160   | 22    |
| 018 | iGroup (Вятский технический лицей, Киров)           | 0   | 60  |     |     |     |     | 0      | 60    | 23    |
| 021 | Пять минут второго (СОШ №3, Сортавала)              | 0   |     |     |     | 0   |     | 0      | 0     | 24    |
|-----+-----------------------------------------------------+-----+-----+-----+-----+-----+-----+--------+-------+-------|

** Материалы

+ [[./2014a-statements.pdf][Условия задач]]
+ [[./2014a-jury.7z][Архив жюри с решениями всех задач]]
+ [[./2014a-runs.7z][Архив подходов участников]]

** Место очного проведения

КОГОАУ «Кировский физико-математический лицей», г. Киров, ул. Труда 16.

** Расписание

*5 октября:*

+ 9:30 - 10:00 :: открытие, объяснение правил
+ 10:00 - 13:00 :: cоревнование
+ 13:00 :: подведение итогов

** Жюри олимпиады

+ Будин Николай Алексеевич, ФМЛ, г. Киров
+ Бураков Иван Александрович, Лицей, г. Кирово-Чепецк
+ Кайсин Илья Сергеевич, ФМЛ, г. Киров
+ Латышев Алексей Сергеевич, НИУ ИТМО, г. Санкт-Петербург
+ Пестов Олег Александрович, ФМЛ, г. Киров

** Организационный комитет

+ Пестов Олег Александрович, ФМЛ, г. Киров
+ Щепин Тимофей Аркадьевич, ФМЛ, г. Киров
+ Ямбарышева Светлана Юрьевна, ФМЛ, г. Киров

** Контакты

Пестов Олег Александрович, +7(909)143-5774, ~oleg.pestov@gmail.com~.

{{{end-block}}}
