bricks/olymp/olymp/ejik/2014a.html
<div class="Page">

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Третья командная олимпиада по программированию Ёjik</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>5 октября 2014 года</b> состоится третья командная олимпиада по
программированию Ёjik (произносится «ёжик»).
Это командное соревнование, которое проводится в один компьютерный тур
продолжительностью 3 часа. Команде из трёх человек предоставляется один
персональный компьютер и предлагается решить несколько задач. Для решения
участники могут использовать следующие языки программирования: C/C++, C#,
Java, Pascal, Python.
</p>

<p>
Задачи олимпиады рассчитаны на самый широкий круг участников: они в
большинстве своем доступны школьникам, не овладевшим целиком основами
языка программирования (например, школьникам, не владеющим строками
или двумерными массивами, будут доступны большинство задач).
</p>

<p>
Понять уровень олимпиады можно посмотрев материалы прошедших
соревнований:
</p>

<ul class="org-ul">
<li><a href="./2013.html">Осень 2013 года</a>
</li>
<li><a href="./2014s.html">Весна 2014 года</a>
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Результаты</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Третья олимпиада Ёjik состоялась. Большое спасибо за участие!
Победителями стали:
</p>

<ol class="org-ol">
<li>Киров, КОГОАУ КФМЛ: половик (Ашихмин Анатолий 8, Сырцев Александр 8, Клёпов Дмитрий 8)
</li>
<li>Гусь-Хрустальный, МБОУ "СОШ №2": Qwerty (Григорьев Дмитрий 10, Пугачева Ирина 10, Лисененков Глеб 10)
</li>
<li>Киров, КОГОАУ КЭПЛ (Перминов Максим 11, Чащин Дмитрий 11, Деревянных Михаил 9)
</li>
</ol>

<p>
Итоговая таблица:
</p>

<table>


<colgroup>
<col  class="center">

<col  class="left">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="center">&#xa0;</th>
<th scope="col" class="left">Команда</th>
<th scope="col" class="center">A</th>
<th scope="col" class="center">B</th>
<th scope="col" class="center">C</th>
<th scope="col" class="center">D</th>
<th scope="col" class="center">E</th>
<th scope="col" class="center">G</th>
<th scope="col" class="center">Задачи</th>
<th scope="col" class="center">Баллы</th>
<th scope="col" class="center">Место</th>
</tr>
</thead>
<tbody>
<tr>
<td class="center">025</td>
<td class="left">половик (КОГОАУ КФМЛ, Киров)</td>
<td class="center">100</td>
<td class="center">80</td>
<td class="center">100</td>
<td class="center">100</td>
<td class="center">100</td>
<td class="center"> </td>
<td class="center">4</td>
<td class="center">480</td>
<td class="center">1</td>
</tr>

<tr>
<td class="center">013</td>
<td class="left">Qwerty (МБОУ "СОШ №2", Гусь-Хрустальный)</td>
<td class="center">100</td>
<td class="center">90</td>
<td class="center">99</td>
<td class="center">100</td>
<td class="center">48</td>
<td class="center">0</td>
<td class="center">3</td>
<td class="center">437</td>
<td class="center">2</td>
</tr>

<tr>
<td class="center">012</td>
<td class="left">КОГОАУ КЭПЛ, Киров</td>
<td class="center">100</td>
<td class="center">70</td>
<td class="center">100</td>
<td class="center">99</td>
<td class="center">55</td>
<td class="center"> </td>
<td class="center">3</td>
<td class="center">424</td>
<td class="center">3</td>
</tr>

<tr>
<td class="center">002</td>
<td class="left">Da Red (КОГОАУ ЛЕН, Киров)</td>
<td class="center">100</td>
<td class="center">80</td>
<td class="center">99</td>
<td class="center">100</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">3</td>
<td class="center">379</td>
<td class="center">4</td>
</tr>

<tr>
<td class="center">004</td>
<td class="left">AcerAspire (МБОУ "Лицей", Кирово-Чепецк)</td>
<td class="center">100</td>
<td class="center">70</td>
<td class="center">64</td>
<td class="center">98</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">332</td>
<td class="center">5</td>
</tr>

<tr>
<td class="center">007</td>
<td class="left">ГБОУ СОШ 1247, Москва</td>
<td class="center">100</td>
<td class="center">60</td>
<td class="center">73</td>
<td class="center">96</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">329</td>
<td class="center">6</td>
</tr>

<tr>
<td class="center">014</td>
<td class="left">Лабиринт (МБОУ "СОШ №2", Гусь-Хрустальный)</td>
<td class="center">100</td>
<td class="center">60</td>
<td class="center">49</td>
<td class="center">100</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">309</td>
<td class="center">7</td>
</tr>

<tr>
<td class="center">016</td>
<td class="left">Премудрый Паскаль (МБОУ "СОШ №2", Гусь-Хрустальный)</td>
<td class="center">100</td>
<td class="center">80</td>
<td class="center">27</td>
<td class="center">100</td>
<td class="center"> </td>
<td class="center">0</td>
<td class="center">2</td>
<td class="center">307</td>
<td class="center">8</td>
</tr>

<tr>
<td class="center">019</td>
<td class="left">DreamTeam (Вятские Поляны)</td>
<td class="center">100</td>
<td class="center">60</td>
<td class="center">44</td>
<td class="center">100</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">304</td>
<td class="center">9</td>
</tr>

<tr>
<td class="center">022</td>
<td class="left">Клякса (МКОУ СОШ №2 с УИОП, Вятские Поляны)</td>
<td class="center">100</td>
<td class="center">50</td>
<td class="center">49</td>
<td class="center">100</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">299</td>
<td class="center">10</td>
</tr>

<tr>
<td class="center">024</td>
<td class="left">МОУ "Лицей №43", Саранск</td>
<td class="center">96</td>
<td class="center">70</td>
<td class="center">31</td>
<td class="center">100</td>
<td class="center">0</td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">297</td>
<td class="center">11</td>
</tr>

<tr>
<td class="center">008</td>
<td class="left">Skill (лицей № 78, Набережные Челны)</td>
<td class="center">100</td>
<td class="center">70</td>
<td class="center">24</td>
<td class="center">97</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">291</td>
<td class="center">12</td>
</tr>

<tr>
<td class="center">011</td>
<td class="left">Dantes (лицей № 78, Набережные Челны)</td>
<td class="center">100</td>
<td class="center">60</td>
<td class="center">39</td>
<td class="center">76</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">1</td>
<td class="center">275</td>
<td class="center">13</td>
</tr>

<tr>
<td class="center">026</td>
<td class="left">Язь и Компилятор (КОГОАУ КФМЛ, Киров)</td>
<td class="center">100</td>
<td class="center">70</td>
<td class="center">0</td>
<td class="center">100</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">270</td>
<td class="center">14</td>
</tr>

<tr>
<td class="center">009</td>
<td class="left">EnTer (лицей № 78, Набережные Челны)</td>
<td class="center">100</td>
<td class="center">70</td>
<td class="center"> </td>
<td class="center">98</td>
<td class="center">0</td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">268</td>
<td class="center">15</td>
</tr>

<tr>
<td class="center">006</td>
<td class="left">Артем и его команда (МБОУ СОШ № 45, Киров)</td>
<td class="center">100</td>
<td class="center">70</td>
<td class="center"> </td>
<td class="center">96</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">266</td>
<td class="center">16</td>
</tr>

<tr>
<td class="center">005</td>
<td class="left">PATRIC (МБОУ "Лицей", Кирово-Чепецк)</td>
<td class="center">99</td>
<td class="center">60</td>
<td class="center"> </td>
<td class="center">100</td>
<td class="center">0</td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">259</td>
<td class="center">17</td>
</tr>

<tr>
<td class="center">001</td>
<td class="left">Три Паскаль (КОГОАУ ЛЕН, Киров)</td>
<td class="center">100</td>
<td class="center">80</td>
<td class="center">24</td>
<td class="center">4</td>
<td class="center">0</td>
<td class="center"> </td>
<td class="center">1</td>
<td class="center">208</td>
<td class="center">18</td>
</tr>

<tr>
<td class="center">020</td>
<td class="left">Penkin &amp; Co (Вятские Поляны)</td>
<td class="center">99</td>
<td class="center">0</td>
<td class="center"> </td>
<td class="center">100</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">199</td>
<td class="center">19</td>
</tr>

<tr>
<td class="center">015</td>
<td class="left">Мужчины (МБОУ "СОШ №2", Гусь-Хрустальный)</td>
<td class="center">100</td>
<td class="center">60</td>
<td class="center">31</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">1</td>
<td class="center">191</td>
<td class="center">20</td>
</tr>

<tr>
<td class="center">017</td>
<td class="left">Кубиты (Вятская православная гимназия, Киров)</td>
<td class="center">99</td>
<td class="center">60</td>
<td class="center">16</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">1</td>
<td class="center">175</td>
<td class="center">21</td>
</tr>

<tr>
<td class="center">003</td>
<td class="left">SuperHero (КОГОАУ ЛЕН, Киров)</td>
<td class="center">100</td>
<td class="center">60</td>
<td class="center"> </td>
<td class="center">0</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">1</td>
<td class="center">160</td>
<td class="center">22</td>
</tr>

<tr>
<td class="center">018</td>
<td class="left">iGroup (Вятский технический лицей, Киров)</td>
<td class="center">0</td>
<td class="center">60</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">0</td>
<td class="center">60</td>
<td class="center">23</td>
</tr>

<tr>
<td class="center">021</td>
<td class="left">Пять минут второго (СОШ №3, Сортавала)</td>
<td class="center">0</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">0</td>
<td class="center"> </td>
<td class="center">0</td>
<td class="center">0</td>
<td class="center">24</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Материалы</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="./2014a-statements.pdf">Условия задач</a>
</li>
<li><a href="./2014a-jury.7z">Архив жюри с решениями всех задач</a>
</li>
<li><a href="./2014a-runs.7z">Архив подходов участников</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Место очного проведения</h3>
<div class="outline-text-3" id="text-1-3">
<p>
КОГОАУ «Кировский физико-математический лицей», г. Киров, ул. Труда 16.
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Расписание</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<b>5 октября:</b>
</p>

<dl class="org-dl">
<dt> 9:30 - 10:00 </dt><dd>открытие, объяснение правил
</dd>
<dt> 10:00 - 13:00 </dt><dd>cоревнование
</dd>
<dt> 13:00 </dt><dd>подведение итогов
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Жюри олимпиады</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Будин Николай Алексеевич, ФМЛ, г. Киров
</li>
<li>Бураков Иван Александрович, Лицей, г. Кирово-Чепецк
</li>
<li>Кайсин Илья Сергеевич, ФМЛ, г. Киров
</li>
<li>Латышев Алексей Сергеевич, НИУ ИТМО, г. Санкт-Петербург
</li>
<li>Пестов Олег Александрович, ФМЛ, г. Киров
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Организационный комитет</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Пестов Олег Александрович, ФМЛ, г. Киров
</li>
<li>Щепин Тимофей Аркадьевич, ФМЛ, г. Киров
</li>
<li>Ямбарышева Светлана Юрьевна, ФМЛ, г. Киров
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">Контакты</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Пестов Олег Александрович, +7(909)143-5774, <code>oleg.pestov@gmail.com</code>.
</p>

</div>
</div>
</div>
</div>
